{
    "templateId": "cliff-jones-demo-comprehensive",
    "templateName": "Cliff Jones - Complete Demo Profile",
    "templateDescription": "Fully populated demo profile showcasing all platform capabilities - VP Strategy at TalentEdge with complete evidence, outcomes, and STAR stories",
    "profile": {
        "name": "Cliff Jones",
        "location": "Philadelphia, Pennsylvania, US",
        "roleLevel": "Executive",
        "currentTitle": "VP Global Strategy, GM Customer Advisory & Futurist",
        "currentCompany": "TalentEdge",
        "yearsExperience": 25,
        "executiveSummary": "Accomplished strategic executive with 25+ years driving transformational change in enterprise talent technology. Proven track record of architecting AI-first solutions that deliver measurable business impact while building high-performing teams and stakeholder relationships. Combines deep technical fluency with strategic foresight to position organizations at the forefront of emerging trends. Co-founder of three ventures including Second Chance Foundation, the world's only aviation-focused mental health and recovery organization.",
        "leadershipPhilosophy": "Leadership is about creating environments where others can do their best work. I believe in leading through authenticity, using vulnerability as a tool to build trust and reduce stigma. My approach combines data-driven decision-making with deep empathy for human experiences. I invest in building genuine relationships and enabling teams to take ownership of outcomes, not just tasks. Having navigated personal recovery and loss, I understand the power of showing up as a whole person—bringing both strategic rigor and human connection to every interaction.",
        "careerNarrative": "My career has been defined by being early to emerging trends and building bridges between technical innovation and business strategy. From co-founding software development firms in my twenties to leading global strategy at a talent intelligence platform, I've consistently positioned at the intersection of technology, people, and organizational transformation. As an FAA-certified IFR pilot with 20+ years of flying experience, I've learned to make critical decisions under pressure with incomplete information—a skill that translates directly to strategic leadership. My work with Second Chance Foundation, providing free mental health and addiction recovery flights, grounds my professional pursuits in a deeper purpose. I'm driven by a conviction that AI's impact on work will be profound, and those who can see around corners while maintaining human-centered focus will define the next era of enterprise technology.",
        "futureVision": "The next phase of talent technology will be defined by AI that augments human judgment rather than replacing it. Organizations that win will separate talent strategy from traditional HR functions, recognizing that strategic recruiting capabilities have become exponentially more valuable in an AI-augmented world. I'm focused on helping companies build 'human-in-the-lead' frameworks where AI serves as an assistant to human decision-makers, not a validator. This requires leadership that understands both the technical possibilities and the human implications—a combination I've spent my career developing.",
        "personalBackground": "Beyond my corporate work, I'm an instrument-rated pilot, professional musician with 30+ years of practice, and recovery advocate. I co-founded Second Chance Foundation after losing my son Kyle to addiction, transforming personal tragedy into a mission to help others. These experiences inform my leadership approach—I know what it means to operate under pressure, to create beauty from discipline, and to lead with vulnerability."
    },
    "roles": [
        { "id": "strategy", "name": "VP Global Strategy", "icon": "🎯", "color": "#ef4444" },
        { "id": "futurist", "name": "Futurist & Evangelist", "icon": "🔮", "color": "#f59e0b" },
        { "id": "tech", "name": "Technology Strategist", "icon": "⚙️", "color": "#06b6d4" },
        { "id": "pilot", "name": "FAA Certified IFR Pilot", "icon": "✈️", "color": "#8b5cf6" },
        { "id": "musician", "name": "Professional Musician", "icon": "🎵", "color": "#ec4899" },
        { "id": "entrepreneur", "name": "Entrepreneur", "icon": "🚀", "color": "#14b8a6" },
        { "id": "advocate", "name": "Recovery Advocate", "icon": "💚", "color": "#10b981" }
    ],
    "strategicOutcomes": [
        {
            "title": "AI Strategy & Predictive Accuracy",
            "metric": "85-95% accuracy over 5 years",
            "timeframe": "2019-2024",
            "description": "Predicted major HR tech trends years ahead of market consensus, including ATS obsolescence, AI-recruiter collaboration models, and the shift from HR to talent strategy functions. Enabled TalentEdge to position products 18-24 months ahead of competitors.",
            "impact": "Critical",
            "evidence": "Published predictions in 2019-2020 about conversational AI, skills-based hiring, and talent marketplace disruption that materialized 2022-2024. Internal strategy memos show consistent 2-year forward accuracy."
        },
        {
            "title": "Stakeholder Engagement at Scale",
            "metric": "70% of role in advisory capacity",
            "timeframe": "2020-2025",
            "description": "Built and led Customer Advisory Board while serving in advisory capacity to sales teams on 200+ enterprise deals. Translated complex AI/ML technical concepts into strategic value propositions for C-suite stakeholders, contributing to $50M+ in closed revenue.",
            "impact": "Critical",
            "evidence": "CAB grew from 12 to 40+ Fortune 500 companies. Sales team feedback scores averaged 9.2/10 for 'strategic value articulation'. Direct attribution to deal acceleration in 60+ opportunities."
        },
        {
            "title": "Thought Leadership & Industry Influence",
            "metric": "15,000+ newsletter subscribers, 25+ speaking engagements",
            "timeframe": "2021-2025",
            "description": "Established as prominent industry voice through 'Strategic Insights' newsletter (15K+ HR/TA executives), keynote speaking at industry conferences, and participation in advisory panels. Shaped industry discourse on AI adoption, talent strategy evolution, and future of work.",
            "impact": "High",
            "evidence": "Newsletter open rates 42% (industry avg 18%). Speaking invitations from HR Tech, Talent Acquisition Week, SHRM. Quoted in HR Executive, Forbes, Built In on AI and talent strategy."
        },
        {
            "title": "Product Innovation & Framework Adoption",
            "metric": "3 proprietary frameworks adopted by industry",
            "timeframe": "2018-2024",
            "description": "Developed Work Blueprint methodology, AI Fluency Models, and Candidate Experience Architecture frameworks that were adopted by competitors and consulting firms. Contributed to 2 patents related to AI-assisted talent matching.",
            "impact": "High",
            "evidence": "Frameworks referenced in competitor marketing materials, consulting decks, and academic papers. Patent filings US20230012345 and US20230067890."
        },
        {
            "title": "Crisis Leadership Under Pressure",
            "metric": "100% crew survival rate in aviation emergency",
            "timeframe": "2018",
            "description": "Successfully executed emergency landing after complete engine failure at 7,000 feet with passengers aboard. Applied systematic decision-making under extreme pressure, maintaining calm communication while executing emergency procedures. Experience directly applicable to corporate crisis management.",
            "impact": "Critical",
            "evidence": "FAA incident report N12345, 2018-08-15. All occupants safe, aircraft recovered. Demonstrates decision-making under life-threatening pressure."
        }
    ],
    "starStories": [
        {
            "id": "ai-strategy-implementation",
            "title": "Leading AI Strategy Transformation",
            "skill": "Strategic Planning",
            "situation": "In 2021, TalentEdge faced increasing competition from AI-native startups. Executive team needed comprehensive AI integration strategy but lacked technical depth to evaluate options.",
            "task": "Develop and implement enterprise-wide AI strategy that would differentiate TalentEdge while maintaining product quality and avoiding over-automation pitfalls common in the industry.",
            "action": "Led cross-functional team through 6-month discovery process. Conducted 40+ customer interviews to understand pain points. Built framework distinguishing AI-replacement vs AI-augmentation opportunities. Presented 3-year roadmap to board with specific milestones, resource requirements, and risk mitigation. Created 'human-in-the-lead' design principles adopted across product org.",
            "result": "Strategy approved with $15M investment. Launched 3 AI-powered features by end of 2022, contributing to 40% increase in enterprise deal size. Framework became foundation for all product decisions, reducing feature churn by 60%. Competitors adopted similar language 18 months later, validating early positioning.",
            "skills": ["Strategic Planning", "Systems Thinking", "Technology Design", "Persuasion"],
            "impact": "Critical"
        },
        {
            "id": "stakeholder-crisis-management",
            "title": "Navigating Product Crisis with Enterprise Client",
            "skill": "Social Perceptiveness",
            "situation": "Major enterprise customer ($2.5M ARR) experienced critical product bug affecting 10,000 users 48 hours before their peak recruiting season. CEO threatening to cancel contract and pursue legal action.",
            "task": "De-escalate crisis, maintain relationship, and coordinate resolution while client was understandably furious and untrusting of technical team's timelines.",
            "action": "Immediately flew to client site (didn't wait for invitation). Met with CEO and CHRO in person, acknowledged failure without defensiveness, explained root cause in business terms (not technical jargon). Stayed on-site for 72 hours, providing hourly updates even through the night. Coordinated engineering, implementation, and support teams. Offered interim manual process to keep recruiting flowing. Personally reviewed every fix before deployment.",
            "result": "Bug resolved in 48 hours vs estimated 5-7 days. Client proceeded with recruiting season successfully. Not only retained contract but expanded into two additional divisions ($1.2M additional ARR). CEO later joined Customer Advisory Board and provided reference for 8 prospects. Relationship deeper than before crisis.",
            "skills": ["Social Perceptiveness", "Service Orientation", "Complex Problem Solving", "Stress Tolerance"],
            "impact": "Critical"
        },
        {
            "id": "aviation-emergency-decision",
            "title": "Engine Failure Emergency Landing",
            "skill": "Judgment and Decision Making",
            "situation": "During IFR flight at 7,000 feet with 3 passengers, engine lost all power over rural Pennsylvania. No suitable airports within glide range. Weather deteriorating. Limited time to make decisions.",
            "task": "Safely land aircraft with total engine failure while managing passenger anxiety and coordinating with ATC under extreme time pressure.",
            "action": "Immediately established best glide speed, declared emergency with ATC, identified field options while running emergency checklist. Made rapid go/no-go decisions on each potential landing site based on slope, obstacles, wind. Maintained calm radio communications. Briefed passengers in reassuring but honest terms. Executed approach to selected field, timing flare perfectly for engine-out landing.",
            "result": "Perfect landing in farmer's field. All occupants safe, aircraft repairable. FAA commended decision-making and execution. Insurance and safety investigators found no fault. Experience became foundation for corporate crisis decision-making framework—prioritize safety, work the problem systematically, communicate clearly, don't panic.",
            "skills": ["Judgment and Decision Making", "Operation and Control", "Monitoring", "Stress Tolerance"],
            "impact": "Critical"
        },
        {
            "id": "thought-leadership-influence",
            "title": "Building Industry Influence Through Content",
            "skill": "Writing",
            "situation": "TalentEdge had strong product but weak brand awareness among talent executives. Marketing budget limited. Needed cost-effective way to build executive-level awareness and trust.",
            "task": "Establish personal and company thought leadership without traditional marketing spend, leveraging my strategic insights and writing ability.",
            "action": "Launched 'Strategic Insights' newsletter in 2021, publishing weekly analyses of talent tech trends. Focused on counterintuitive insights that challenged industry conventional wisdom. Wrote in accessible style blending data, storytelling, and strategic frameworks. Promoted organically through LinkedIn and speaking engagements. Maintained rigorous quality—would rather skip a week than publish mediocre content.",
            "result": "Grew to 15,000+ subscribers (CHROs, VPs of TA, talent leaders) with 42% open rate. Generated 300+ inbound leads for sales team. Speaking invitations from major conferences. Positioned as strategic thinker vs product vendor. Competitors began citing my frameworks in their materials (validation of influence). Zero paid promotion—all organic growth.",
            "skills": ["Writing", "Strategic Planning", "Innovation", "Marketing"],
            "impact": "High"
        },
        {
            "id": "team-transformation",
            "title": "Transforming Underperforming Strategy Team",
            "skill": "Management of Personnel Resources",
            "situation": "Inherited strategy team of 5 with low morale, unclear mandate, and reputation as 'the team that writes reports no one reads.' High turnover risk, questioned value by executive leadership.",
            "task": "Transform team into high-performing strategic asset within 12 months while retaining talent and rebuilding credibility with leadership.",
            "action": "Started with individual conversations to understand each person's strengths and frustrations. Redefined team mission from 'research and reports' to 'strategic navigation and foresight.' Shifted from reactive (answering executive questions) to proactive (identifying opportunities before they're obvious). Created framework for prioritizing work based on strategic impact. Invested in individual development—sent team to conferences, brought in expert speakers, created internal knowledge-sharing. Personally coached each member on executive communication. Changed deliverable formats from long reports to concise executive briefings with clear recommendations.",
            "result": "Zero attrition over 2 years (vs 40% annual turnover previously). Team's recommendations led to 3 major product pivots that generated $20M+ in new revenue. Executive team began requesting strategy team input proactively. Two team members promoted to director level. Team expanded from 5 to 8 based on demonstrated value. Personal satisfaction: seeing team members thrive and grow.",
            "skills": ["Management of Personnel Resources", "Coaching", "Service Orientation", "Strategic Planning"],
            "impact": "High"
        },
        {
            "id": "recovery-advocacy-impact",
            "title": "Founding Second Chance Foundation",
            "skill": "Service Orientation",
            "situation": "After losing my son Kyle to addiction in 2017, I recognized massive gap in mental health and addiction services—particularly access to treatment due to geographic and financial barriers. As a pilot, I had unique capability to help.",
            "task": "Channel personal tragedy into systemic impact by creating organization that provides free flights for individuals seeking mental health and addiction treatment.",
            "action": "Co-founded Second Chance Foundation, the world's only aviation-focused mental health and recovery charity. Built network of volunteer pilots. Established partnerships with treatment centers. Created safe, dignified transportation for people in crisis. Shared my own story publicly to reduce stigma despite professional risk. Integrated recovery advocacy into my corporate leadership identity, making vulnerability a strength.",
            "result": "Transported 200+ individuals to treatment facilities over 7 years. 85% of transported individuals completed treatment programs (vs 40% industry average—access timing matters). Raised $500K+ through aviation community. Created model adopted by 3 similar regional programs. Personal impact: turned deepest grief into meaningful service. Professional impact: authenticity became leadership differentiator, building deeper trust with teams and stakeholders.",
            "skills": ["Service Orientation", "Social Perceptiveness", "Coordination", "Speaking"],
            "impact": "Critical"
        },
        {
            "id": "product-framework-creation",
            "title": "Creating Work Blueprint Methodology",
            "skill": "Innovation",
            "situation": "Recruiting industry lacked systematic framework for candidates to understand and communicate their strategic value. Resume format hadn't evolved in decades despite changing nature of work. Career coaching advice often generic and unhelpful.",
            "task": "Develop new methodology for career positioning that integrated skills assessment, market intelligence, and strategic narrative in actionable framework.",
            "action": "Synthesized insights from behavioral economics, talent assessment research, and competitive positioning strategy. Built skills ontology connecting proficiency levels to market impact. Created compensation framework based on skill portfolio composition vs arbitrary pricing. Developed 'Work Blueprint' document format—comprehensive strategic positioning vs traditional resume. Tested with 50+ professionals, refined based on feedback. Open-sourced core concepts to drive adoption.",
            "result": "Framework adopted by career coaches, outplacement firms, and recruiting professionals. Cited in industry publications and academic papers. Used successfully by executives in negotiations, demonstrating 15-25% higher offers vs control group. Consulting firms built services around methodology. Personal validation: solved real problem that helped people navigate careers more strategically.",
            "skills": ["Innovation", "Systems Thinking", "Writing", "Research"],
            "impact": "High"
        },
        {
            "id": "ai-fluency-training",
            "title": "Building AI Fluency Across Sales Organization",
            "skill": "Instructing",
            "situation": "TalentEdge sales team (60 reps) struggled to articulate AI product capabilities credibly to technical buyers. Defaulted to buzzwords, lost deals to competitors with better technical storytelling. Engineering team frustrated by misrepresented capabilities.",
            "task": "Build genuine AI fluency across non-technical sales organization without turning them into engineers—needed practical understanding that enabled credible conversations.",
            "action": "Designed 'AI Fluency for Sales' program—not traditional training but experiential learning. Created hands-on exercises with actual AI models so reps could see capabilities and limitations firsthand. Developed framework distinguishing AI categories (NLP, computer vision, ML) with clear use cases. Built 'translation guide' from technical terminology to business outcomes. Ran weekly office hours for questions. Created one-page 'cheat sheets' for common buyer questions. Made it voluntary but incentivized with certification.",
            "result": "92% of sales team completed program voluntarily. Technical win rate improved from 35% to 68% within 6 months. Engineering team reported dramatic reduction in 'impossible promises' from sales. Reps reported increased confidence in technical conversations. Program adopted by Customer Success and Marketing. External demand—3 customers asked us to run program for their teams.",
            "skills": ["Instructing", "Technology Design", "Speaking", "Active Learning"],
            "impact": "High"
        }
    ],
    "skills": [
        {
            "name": "Critical Thinking",
            "proficiency": "Mastery",
            "roles": ["strategy", "futurist", "pilot"],
            "category": "skill",
            "evidence": [
                {
                    "description": "Predicted ATS market obsolescence in 2019, validated by 2023 market consolidation and shift to talent intelligence platforms",
                    "outcome": "Enabled TalentEdge to pivot product strategy 3 years ahead of competition, capturing $25M in displaced ATS revenue"
                },
                {
                    "description": "Analyzed 15 enterprise AI vendor pitches for executive team, identifying 3 substantive vs 12 vaporware solutions",
                    "outcome": "Avoided $2M+ in failed AI implementations, selected partners that delivered 40% productivity gains"
                },
                {
                    "description": "Systematically challenged assumption that 'more AI = better outcomes' in product design, advocating for human-in-the-lead framework",
                    "outcome": "Product differentiation led to 25% premium pricing vs competitors, cited in 80% of won deals"
                }
            ],
            "outcomes": [
                "Strategic decisions based on rigorous analysis vs industry hype, 85-95% accuracy on 5-year predictions",
                "Ability to separate signal from noise in complex, ambiguous situations with multiple stakeholders"
            ]
        },
        {
            "name": "Complex Problem Solving",
            "proficiency": "Mastery",
            "roles": ["strategy", "futurist", "pilot"],
            "category": "skill",
            "evidence": [
                {
                    "description": "Resolved $2.5M customer crisis in 48 hours by coordinating 4 teams across engineering, support, implementation, and executive leadership",
                    "outcome": "Retained customer, expanded contract by $1.2M, CEO became CAB member and reference account"
                },
                {
                    "description": "Diagnosed root cause of 40% sales cycle slowdown as misalignment between product roadmap and customer buying patterns, not competitive issues",
                    "outcome": "Realigned roadmap priorities, sales cycle returned to normal within 2 quarters, closed $8M in stalled pipeline"
                }
            ],
            "outcomes": [
                "Solve multi-variable strategic problems with incomplete information under time pressure",
                "Pattern recognition across disparate domains (aviation, music, business strategy) enables novel solutions"
            ]
        },
        {
            "name": "Judgment and Decision Making",
            "proficiency": "Mastery",
            "roles": ["strategy", "pilot"],
            "category": "skill",
            "evidence": [
                {
                    "description": "Engine failure emergency at 7,000 feet—made rapid go/no-go decisions on landing sites under extreme pressure, executed flawless emergency landing",
                    "outcome": "All passengers safe, aircraft recoverable, FAA commended decision-making, no violations"
                },
                {
                    "description": "Decided to cancel $5M product initiative despite 18 months of development when market research showed demand had shifted",
                    "outcome": "Avoided sunk cost fallacy, reallocated resources to higher-value initiative that generated $12M in first year"
                },
                {
                    "description": "Made call to fly to customer site immediately during crisis vs waiting for invitation—read situation as requiring personal presence",
                    "outcome": "CEO later said 'showing up in person saved the relationship—showed you understood severity'"
                }
            ],
            "outcomes": [
                "Make high-stakes decisions with 90%+ accuracy under pressure, incomplete information, and time constraints",
                "Calibrated risk assessment—know when to decide quickly vs gather more data"
            ]
        },
        {
            "name": "Systems Analysis",
            "proficiency": "Mastery",
            "roles": ["strategy", "tech"],
            "category": "skill",
            "evidence": [
                {
                    "description": "Mapped talent acquisition technology landscape showing interdependencies between 8 system categories, identified 3 consolidation opportunities",
                    "outcome": "Framework adopted by industry analysts, informed M&A strategy, predicted 4 of 5 major acquisitions"
                },
                {
                    "description": "Analyzed enterprise customer's hiring workflow across 15 systems, identified 60% redundancy and 3 critical integration gaps",
                    "outcome": "Redesigned workflow reduced time-to-hire by 35%, became template for 20+ similar customers"
                }
            ],
            "outcomes": [
                "Map complex systems showing relationships, dependencies, and leverage points for intervention",
                "Identify systemic issues vs surface symptoms, enabling root cause solutions"
            ]
        },
        {
            "name": "Active Learning",
            "proficiency": "Mastery",
            "roles": ["strategy", "futurist"],
            "category": "skill",
            "evidence": [
                {
                    "description": "Self-taught AI/ML fundamentals through MIT OpenCourseWare, Stanford CS courses, and hands-on projects to credibly discuss technical strategy",
                    "outcome": "Credibility with engineering teams and technical buyers, no need for 'translation layer' in strategic discussions"
                },
                {
                    "description": "Learned aviation weather theory, instrument procedures, and emergency protocols through self-study for instrument rating",
                    "outcome": "Passed FAA knowledge and practical exams first attempt, 20+ years safe IFR flying"
                }
            ],
            "outcomes": [
                "Rapidly acquire new knowledge domains needed for strategic decisions, comfortable in beginner mindset",
                "Transfer learning across domains—aviation principles inform business strategy, music practice informs skill development"
            ]
        },
        {
            "name": "Stress Tolerance",
            "proficiency": "Mastery",
            "roles": ["pilot", "strategy", "advocate"],
            "category": "ability",
            "evidence": [
                {
                    "description": "Maintained calm during engine failure emergency, executing checklist while managing passenger anxiety and coordinating with ATC",
                    "outcome": "Safe landing, no panic, passengers later commented on 'reassuring demeanor under pressure'"
                },
                {
                    "description": "Led strategy team through 3 CEO transitions and 2 major org restructures while maintaining team morale and productivity",
                    "outcome": "Zero attrition during transitions (vs 50% typical), team delivery consistency maintained"
                },
                {
                    "description": "Navigated personal grief (son's death) while maintaining executive performance and founding Second Chance Foundation",
                    "outcome": "Transformed tragedy into purpose-driven leadership, authenticity became strategic differentiator"
                }
            ],
            "outcomes": [
                "Performance improves under pressure rather than degrades—crisis brings clarity and focus",
                "Model calm for teams during uncertainty, reducing organizational anxiety"
            ]
        },
        {
            "name": "Speaking",
            "proficiency": "Mastery",
            "roles": ["strategy", "futurist", "advocate"],
            "category": "skill",
            "evidence": [
                {
                    "description": "Keynote speaker at HR Tech Conference (2,500 attendees) on 'AI Strategy vs AI Theater'—standing room only, 9.4/10 rating",
                    "outcome": "Generated 45 inbound leads for sales team, invited to return for 2024 and 2025"
                },
                {
                    "description": "Board presentations on AI strategy—translated complex technical concepts for non-technical directors, secured $15M investment",
                    "outcome": "100% board approval, comments: 'finally understood what AI actually means for the business'"
                },
                {
                    "description": "Shared recovery story at industry events, reducing stigma and building authentic connections",
                    "outcome": "12 executives privately shared similar experiences, several became champions for workplace mental health initiatives"
                }
            ],
            "outcomes": [
                "Command attention from diverse audiences (technical, executive, public), adapt complexity to audience",
                "Use storytelling to make complex concepts memorable and actionable"
            ]
        },
        {
            "name": "Writing",
            "proficiency": "Mastery",
            "roles": ["strategy", "futurist"],
            "category": "skill",
            "evidence": [
                {
                    "description": "'Strategic Insights' newsletter—15,000+ subscribers, 42% open rate (2.3x industry average), published 150+ issues over 3 years",
                    "outcome": "Generated 300+ sales leads, established thought leadership, no paid promotion—all organic growth"
                },
                {
                    "description": "Authored 25+ strategy documents for executive leadership ranging from 1-page memos to 40-page strategic plans",
                    "outcome": "Executive team quoted: 'Best strategic writing we've seen—clear, actionable, makes complex simple'"
                },
                {
                    "description": "Contributed articles to HR Executive, Forbes, Built In on AI and talent strategy",
                    "outcome": "Media mentions drove brand awareness, positioned as industry expert vs vendor"
                }
            ],
            "outcomes": [
                "Write clearly for executive audiences—eliminate jargon, lead with insights, support with data",
                "Blend analysis with narrative to make strategic concepts sticky and shareable"
            ]
        },
        {
            "name": "Social Perceptiveness",
            "proficiency": "Mastery",
            "roles": ["strategy", "advocate"],
            "category": "skill",
            "evidence": [
                {
                    "description": "Read customer CEO's frustration during crisis as stemming from feeling unheard vs actual product failure—shifted approach from technical fixes to active listening",
                    "outcome": "Relationship salvaged by acknowledging emotional context, not just solving technical problem"
                },
                {
                    "description": "Detected team member's disengagement 3 months before resignation, intervened with coaching and role adjustment",
                    "outcome": "Team member stayed, became top performer, later said 'you saw what I couldn't articulate'"
                },
                {
                    "description": "Recognized when recovery advocacy resonates vs overwhelms in professional contexts—calibrate vulnerability to audience",
                    "outcome": "Authentic connections without making others uncomfortable, several executives sought advice privately"
                }
            ],
            "outcomes": [
                "Read subtext in conversations—what people mean vs what they say, detect underlying concerns",
                "Adjust communication style to emotional state of stakeholders, build trust through empathy"
            ]
        },
        {
            "name": "Operations Monitoring",
            "proficiency": "Mastery",
            "roles": ["pilot", "strategy"],
            "category": "skill",
            "evidence": [
                {
                    "description": "IFR pilot training—simultaneously monitor 6+ instruments (altitude, heading, speed, attitude, navigation, fuel) while executing flight plan",
                    "outcome": "20+ years safe IFR flying, zero incidents, ability to detect anomalies before they become critical"
                },
                {
                    "description": "Dashboard design for CAB health monitoring—track 12 engagement metrics, identify declining accounts 60 days before churn risk",
                    "outcome": "Proactive interventions prevented 8 CAB member departures, maintained 95% retention vs 70% industry average"
                }
            ],
            "outcomes": [
                "Monitor multiple operational indicators simultaneously, pattern-match for early warning signals",
                "Distinguish normal variation from meaningful deviations requiring intervention"
            ]
        }
    ]
}
        ,
        {
            "name": "Learning Strategies",
            "proficiency": "Advanced",
            "roles": ["strategy", "futurist"],
            "category": "skill",
            "evidence": [
                {
                    "description": "Designed 'AI Fluency for Sales' experiential learning program with hands-on exercises vs traditional lectures",
                    "outcome": "92% voluntary completion rate, technical win rate improved from 35% to 68%"
                }
            ],
            "outcomes": ["Create learning experiences that stick through practice vs theory"]
        },
        {
            "name": "Monitoring",
            "proficiency": "Mastery",
            "roles": ["strategy", "pilot"],
            "category": "skill",
            "evidence": [
                {
                    "description": "Continuous monitoring of 40 CAB member companies for engagement signals and potential churn indicators",
                    "outcome": "Identified at-risk accounts 60 days early, maintained 95% retention"
                }
            ],
            "outcomes": ["Track multiple metrics simultaneously, spot patterns indicating future issues"]
        },
        {
            "name": "Systems Evaluation",
            "proficiency": "Mastery",
            "roles": ["strategy", "tech"],
            "category": "skill",
            "evidence": [
                {
                    "description": "Evaluated 15 AI vendor solutions for executive team, separating substantive capability from vaporware",
                    "outcome": "Selected 3 partners that delivered, avoided $2M+ in failed implementations"
                }
            ],
            "outcomes": ["Assess systems against requirements, identify gaps before commitment"]
        },
        {
            "name": "Operations Analysis",
            "proficiency": "Advanced",
            "roles": ["strategy", "tech", "pilot"],
            "category": "skill",
            "evidence": [
                {
                    "description": "Analyzed customer hiring workflows across 15 systems, found 60% redundancy",
                    "outcome": "Redesigned process reduced time-to-hire by 35%, became template for 20+ customers"
                }
            ],
            "outcomes": ["Identify operational inefficiencies and redesign for performance"]
        },
        {
            "name": "Operation and Control",
            "proficiency": "Mastery",
            "roles": ["pilot"],
            "category": "skill",
            "evidence": [
                {
                    "description": "2000+ hours as pilot-in-command including complex single-pilot IFR operations",
                    "outcome": "Zero incidents over 20+ years, FAA commendation for emergency handling"
                }
            ],
            "outcomes": ["Direct complex systems under normal and emergency conditions"]
        },
        {
            "name": "Active Listening",
            "proficiency": "Mastery",
            "roles": ["strategy", "advocate", "musician"],
            "category": "skill",
            "evidence": [
                {
                    "description": "Customer crisis resolution—listened for underlying concerns vs surface complaints",
                    "outcome": "CEO said 'you heard what we needed vs what we said'—relationship salvaged"
                }
            ],
            "outcomes": ["Listen for meaning, emotion, and unspoken concerns in stakeholder conversations"]
        },
        {
            "name": "Persuasion",
            "proficiency": "Mastery",
            "roles": ["strategy", "futurist"],
            "category": "skill",
            "evidence": [
                {
                    "description": "Convinced board to invest $15M in AI strategy despite skepticism about ROI timeline",
                    "outcome": "100% approval, features launched on schedule, 40% increase in enterprise deal size"
                }
            ],
            "outcomes": ["Influence decisions through logic, data, and narrative without positional authority"]
        },
        {
            "name": "Negotiation",
            "proficiency": "Advanced",
            "roles": ["strategy", "entrepreneur"],
            "category": "skill",
            "evidence": [
                {
                    "description": "Negotiated partnership terms with 3 major vendors for TalentEdge integrations",
                    "outcome": "Secured favorable revenue share and technical support commitments"
                }
            ],
            "outcomes": ["Find mutually beneficial solutions in complex multi-party negotiations"]
        },
        {
            "name": "Instructing",
            "proficiency": "Advanced",
            "roles": ["strategy", "advocate"],
            "category": "skill",
            "evidence": [
                {
                    "description": "Taught AI fluency to 60-person sales team through experiential learning program",
                    "outcome": "Technical win rate improved 33 percentage points, program adopted by Customer Success"
                }
            ],
            "outcomes": ["Teach complex concepts to diverse learners through hands-on practice"]
        },
        {
            "name": "Coordination",
            "proficiency": "Mastery",
            "roles": ["strategy", "pilot", "musician"],
            "category": "skill",
            "evidence": [
                {
                    "description": "Coordinated 4 teams (engineering, support, implementation, executive) during customer crisis",
                    "outcome": "Resolved critical issue in 48 hours vs estimated 5-7 days"
                }
            ],
            "outcomes": ["Orchestrate multiple teams toward common goal under time pressure"]
        },
        {
            "name": "Service Orientation",
            "proficiency": "Mastery",
            "roles": ["advocate", "strategy"],
            "category": "skill",
            "evidence": [
                {
                    "description": "Founded Second Chance Foundation providing free flights for mental health/addiction treatment",
                    "outcome": "Transported 200+ individuals, 85% treatment completion rate vs 40% industry average"
                }
            ],
            "outcomes": ["Actively seek ways to help others, service as core motivation"]
        },
        {
            "name": "Time Management",
            "proficiency": "Advanced",
            "roles": ["strategy", "entrepreneur"],
            "category": "skill",
            "evidence": [
                {
                    "description": "Balanced VP role, CAB leadership, newsletter publishing, speaking engagements, and foundation work",
                    "outcome": "Maintained high performance across all commitments without burnout"
                }
            ],
            "outcomes": ["Prioritize ruthlessly, delegate effectively, protect strategic thinking time"]
        },
        {
            "name": "Management of Financial Resources",
            "proficiency": "Advanced",
            "roles": ["entrepreneur", "strategy"],
            "category": "skill",
            "evidence": [
                {
                    "description": "Co-founded 3 companies, managed P&L and resource allocation decisions",
                    "outcome": "Sustained profitability across ventures, Second Chance Foundation raised $500K+"
                }
            ],
            "outcomes": ["Budget allocation, financial planning, resource optimization for strategic goals"]
        },
        {
            "name": "Management of Material Resources",
            "proficiency": "Advanced",
            "roles": ["entrepreneur"],
            "category": "skill",
            "evidence": [
                {
                    "description": "Managed equipment and facilities for software development firm and foundation",
                    "outcome": "Optimized resource utilization, maintained operations within budget"
                }
            ],
            "outcomes": ["Procure, allocate, and optimize physical resources for organizational needs"]
        },
        {
            "name": "Management of Personnel Resources",
            "proficiency": "Advanced",
            "roles": ["strategy", "entrepreneur"],
            "category": "skill",
            "evidence": [
                {
                    "description": "Transformed underperforming strategy team of 5 into high-performing asset",
                    "outcome": "Zero attrition over 2 years vs 40% previous turnover, team expanded to 8"
                }
            ],
            "outcomes": ["Hire, develop, motivate teams; create environments where people thrive"]
        },
        {
            "name": "Technology Design",
            "proficiency": "Advanced",
            "roles": ["tech"],
            "category": "skill",
            "evidence": [
                {
                    "description": "Contributed to product design decisions for AI-powered talent matching features",
                    "outcome": "Features delivered 40% productivity gains, became competitive differentiator"
                }
            ],
            "outcomes": ["Design technology solutions that balance capability with usability"]
        },
        {
            "name": "Equipment Selection",
            "proficiency": "Advanced",
            "roles": ["pilot", "tech"],
            "category": "skill",
            "evidence": [
                {
                    "description": "Selected avionics upgrades for aircraft based on mission requirements and budget",
                    "outcome": "Improved IFR capability while maintaining cost-effectiveness"
                }
            ],
            "outcomes": ["Evaluate and select tools/equipment based on needs analysis"]
        },
        {
            "name": "Programming",
            "proficiency": "Proficient",
            "roles": ["tech"],
            "category": "skill",
            "evidence": [
                {
                    "description": "Wrote Python scripts for data analysis and automation in strategy work",
                    "outcome": "Self-sufficient for analysis needs, credibility with engineering teams"
                }
            ],
            "outcomes": ["Write functional code for analysis and automation"]
        },
        {
            "name": "Quality Control Analysis",
            "proficiency": "Advanced",
            "roles": ["strategy", "tech"],
            "category": "skill",
            "evidence": [
                {
                    "description": "Reviewed product features before launch for strategic alignment and quality",
                    "outcome": "Prevented 3 feature releases that would have confused market positioning"
                }
            ],
            "outcomes": ["Assess quality against standards, identify defects before they reach customers"]
        },
        {
            "name": "Troubleshooting",
            "proficiency": "Mastery",
            "roles": ["pilot", "tech"],
            "category": "skill",
            "evidence": [
                {
                    "description": "Diagnosed engine failure cause during emergency through systematic checklist execution",
                    "outcome": "Successful emergency landing, FAA investigation found no pilot error"
                }
            ],
            "outcomes": ["Systematically diagnose root causes under pressure, solve complex technical issues"]
        },
        {
            "name": "Mathematics",
            "proficiency": "Advanced",
            "roles": ["pilot", "tech"],
            "category": "skill",
            "evidence": [
                {
                    "description": "Applied mathematical concepts in aviation (fuel calculations, navigation, performance) and data analysis",
                    "outcome": "Precise flight planning, quantitative strategic analysis"
                }
            ],
            "outcomes": ["Use mathematical reasoning for decision support and analysis"]
        },
        {
            "name": "Science",
            "proficiency": "Advanced",
            "roles": ["pilot", "futurist"],
            "category": "skill",
            "evidence": [
                {
                    "description": "Applied scientific method to test strategic hypotheses and market predictions",
                    "outcome": "85-95% prediction accuracy through evidence-based analysis"
                }
            ],
            "outcomes": ["Apply scientific reasoning to business strategy and technology evaluation"]
        },
        {
            "name": "Reading Comprehension",
            "proficiency": "Mastery",
            "roles": ["strategy", "futurist"],
            "category": "skill",
            "evidence": [
                {
                    "description": "Synthesized insights from 100+ research papers, industry reports, and technical documentation for strategy work",
                    "outcome": "Frameworks adopted by industry, predictions validated by market evolution"
                }
            ],
            "outcomes": ["Extract insights from complex written material, synthesize across sources"]
        },
        {
            "name": "Problem Sensitivity",
            "proficiency": "Mastery",
            "roles": ["strategy", "pilot"],
            "category": "ability",
            "evidence": [
                {
                    "description": "Detected early signs of product-market misalignment before sales slowdown became crisis",
                    "outcome": "Course correction saved 6 months of wasted development"
                }
            ],
            "outcomes": ["Sense when something is wrong before it becomes obvious"]
        },
        {
            "name": "Deductive Reasoning",
            "proficiency": "Mastery",
            "roles": ["strategy", "pilot"],
            "category": "ability",
            "evidence": [
                {
                    "description": "Applied logical frameworks to narrow emergency landing options from general rules to specific choice",
                    "outcome": "Selected optimal landing site under extreme time pressure"
                }
            ],
            "outcomes": ["Apply general rules to specific situations to reach sound conclusions"]
        },
        {
            "name": "Inductive Reasoning",
            "proficiency": "Mastery",
            "roles": ["strategy", "futurist"],
            "category": "ability",
            "evidence": [
                {
                    "description": "Identified pattern across 20+ market signals to predict ATS obsolescence in 2019",
                    "outcome": "Prediction validated 2023-2024, positioned TalentEdge ahead of competition"
                }
            ],
            "outcomes": ["Combine separate pieces of information to form general conclusions"]
        },
        {
            "name": "Information Ordering",
            "proficiency": "Mastery",
            "roles": ["strategy", "pilot"],
            "category": "ability",
            "evidence": [
                {
                    "description": "Organized emergency checklist steps in optimal sequence during engine failure",
                    "outcome": "Executed all critical actions in correct order under pressure"
                }
            ],
            "outcomes": ["Arrange information in optimal sequence for decision-making"]
        },
        {
            "name": "Category Flexibility",
            "proficiency": "Mastery",
            "roles": ["futurist", "strategy"],
            "category": "ability",
            "evidence": [
                {
                    "description": "Shifted mental models from 'HR tech' to 'talent intelligence' to 'AI-augmented work'",
                    "outcome": "Anticipated market evolution before competitors, influenced industry discourse"
                }
            ],
            "outcomes": ["Generate or use different sets of rules for categorizing things"]
        },
        {
            "name": "Mathematical Reasoning",
            "proficiency": "Advanced",
            "roles": ["pilot", "tech"],
            "category": "ability",
            "evidence": [
                {
                    "description": "Calculated weight & balance, fuel requirements, and navigation solutions for complex IFR flights",
                    "outcome": "20+ years safe flying, zero incidents related to calculation errors"
                }
            ],
            "outcomes": ["Choose right mathematical methods and formulas to solve problems"]
        },
        {
            "name": "Memorization",
            "proficiency": "Advanced",
            "roles": ["pilot", "musician"],
            "category": "ability",
            "evidence": [
                {
                    "description": "Memorized emergency procedures, approach plates, and musical repertoire for performance",
                    "outcome": "Rapid recall under pressure in cockpit and on stage"
                }
            ],
            "outcomes": ["Remember information like words, numbers, procedures"]
        },
        {
            "name": "Speed of Closure",
            "proficiency": "Mastery",
            "roles": ["pilot", "strategy"],
            "category": "ability",
            "evidence": [
                {
                    "description": "Quickly identified landing site pattern from complex terrain during emergency",
                    "outcome": "Made go/no-go decisions in seconds, selected safe landing area"
                }
            ],
            "outcomes": ["Quickly make sense of scattered information to identify patterns"]
        },
        {
            "name": "Perceptual Speed",
            "proficiency": "Mastery",
            "roles": ["pilot"],
            "category": "ability",
            "evidence": [
                {
                    "description": "Rapidly scanned instrument panel during IFR operations to detect deviations",
                    "outcome": "Maintained precise altitude, heading, speed in challenging conditions"
                }
            ],
            "outcomes": ["Quickly compare similarities and differences among things"]
        },
        {
            "name": "Spatial Orientation",
            "proficiency": "Mastery",
            "roles": ["pilot", "strategy"],
            "category": "ability",
            "evidence": [
                {
                    "description": "Maintained aircraft orientation in instrument meteorological conditions without visual references",
                    "outcome": "Safe IFR operations in challenging weather, never experienced spatial disorientation"
                }
            ],
            "outcomes": ["Know where you are in relation to the environment"]
        },
        {
            "name": "Visualization",
            "proficiency": "Mastery",
            "roles": ["strategy", "pilot"],
            "category": "ability",
            "evidence": [
                {
                    "description": "Mental models of complex systems enable seeing how changes propagate through organizations",
                    "outcome": "Accurate predictions of second and third-order effects of strategic decisions"
                }
            ],
            "outcomes": ["Imagine how something will look after it's moved or rearranged"]
        },
        {
            "name": "Selective Attention",
            "proficiency": "Mastery",
            "roles": ["pilot", "strategy"],
            "category": "ability",
            "evidence": [
                {
                    "description": "Maintained focus on critical instruments during emergency while filtering distractions",
                    "outcome": "Never lost situational awareness despite high stress and competing demands"
                }
            ],
            "outcomes": ["Concentrate on a task while ignoring distractions"]
        },
        {
            "name": "Time Sharing",
            "proficiency": "Mastery",
            "roles": ["pilot", "musician"],
            "category": "ability",
            "evidence": [
                {
                    "description": "Simultaneously fly aircraft, communicate with ATC, navigate, and monitor systems in IFR conditions",
                    "outcome": "Never missed radio calls or deviated from clearance while managing multiple tasks"
                }
            ],
            "outcomes": ["Shift back and forth between activities without losing track"]
        },
        {
            "name": "Oral Comprehension",
            "proficiency": "Mastery",
            "roles": ["strategy", "pilot"],
            "category": "ability",
            "evidence": [
                {
                    "description": "Understood rapid ATC communications in high-traffic environments",
                    "outcome": "Never required repeat of instructions, maintained safe separation"
                }
            ],
            "outcomes": ["Listen and understand spoken words and sentences"]
        },
        {
            "name": "Oral Expression",
            "proficiency": "Mastery",
            "roles": ["strategy", "futurist"],
            "category": "ability",
            "evidence": [
                {
                    "description": "Keynote presentations rated 9.4/10 for clarity and engagement",
                    "outcome": "Complex ideas accessible to diverse audiences, generated 45 inbound leads"
                }
            ],
            "outcomes": ["Communicate information clearly by speaking"]
        },
        {
            "name": "Written Comprehension",
            "proficiency": "Mastery",
            "roles": ["strategy"],
            "category": "ability",
            "evidence": [
                {
                    "description": "Synthesized insights from 100+ technical papers and industry reports",
                    "outcome": "Frameworks validated by market evolution, adopted by competitors"
                }
            ],
            "outcomes": ["Read and understand written information"]
        },
        {
            "name": "Written Expression",
            "proficiency": "Mastery",
            "roles": ["strategy", "futurist"],
            "category": "ability",
            "evidence": [
                {
                    "description": "Newsletter achieved 42% open rate (2.3x industry average) through clear writing",
                    "outcome": "15K+ subscribers, 300+ sales leads, zero paid promotion"
                }
            ],
            "outcomes": ["Communicate information effectively in writing"]
        },
        {
            "name": "Fluency of Ideas",
            "proficiency": "Mastery",
            "roles": ["futurist", "strategy"],
            "category": "ability",
            "evidence": [
                {
                    "description": "Generated 50+ strategic hypotheses about market evolution in workshop sessions",
                    "outcome": "Teams able to evaluate multiple scenarios and prepare contingencies"
                }
            ],
            "outcomes": ["Come up with many ideas about a topic quickly"]
        },
        {
            "name": "Originality",
            "proficiency": "Mastery",
            "roles": ["futurist", "musician"],
            "category": "ability",
            "evidence": [
                {
                    "description": "Created 'human-in-the-lead' framework as alternative to ubiquitous 'human-in-the-loop' thinking",
                    "outcome": "Framework adopted by industry, shifted discourse on AI collaboration models"
                }
            ],
            "outcomes": ["Come up with unusual or clever ideas about a given topic"]
        },
        {
            "name": "Control Precision",
            "proficiency": "Mastery",
            "roles": ["pilot", "musician"],
            "category": "ability",
            "evidence": [
                {
                    "description": "Precise aircraft control during engine-out landing—timing and flare execution critical",
                    "outcome": "Perfect touchdown in field, no injuries, aircraft recoverable"
                }
            ],
            "outcomes": ["Quickly and repeatedly adjust controls to exact positions"]
        },
        {
            "name": "Multilimb Coordination",
            "proficiency": "Mastery",
            "roles": ["pilot", "musician"],
            "category": "ability",
            "evidence": [
                {
                    "description": "Coordinated hands and feet for aircraft control during complex maneuvers",
                    "outcome": "Smooth, precise flight operations; musical performance with bass/vocals simultaneously"
                }
            ],
            "outcomes": ["Coordinate movements of two or more limbs while sitting, standing, or lying down"]
        },
        {
            "name": "Response Orientation",
            "proficiency": "Mastery",
            "roles": ["pilot"],
            "category": "ability",
            "evidence": [
                {
                    "description": "Rapid response to unexpected engine failure—established best glide within 3 seconds",
                    "outcome": "Optimized glide distance, maximized landing site options"
                }
            ],
            "outcomes": ["Choose quickly between movements in response to different signals"]
        },
        {
            "name": "Rate Control",
            "proficiency": "Mastery",
            "roles": ["pilot"],
            "category": "ability",
            "evidence": [
                {
                    "description": "Controlled aircraft descent rate during emergency landing approach",
                    "outcome": "Perfect energy management, touchdown at exact target point"
                }
            ],
            "outcomes": ["Time movements in response to changes in speed/direction of moving objects"]
        },
        {
            "name": "Reaction Time",
            "proficiency": "Mastery",
            "roles": ["pilot"],
            "category": "ability",
            "evidence": [
                {
                    "description": "Immediate response to engine failure—checklist initiated within seconds",
                    "outcome": "No delay in critical actions, maximized outcome possibilities"
                }
            ],
            "outcomes": ["Respond quickly to a signal when it appears"]
        },
        {
            "name": "Manual Dexterity",
            "proficiency": "Mastery",
            "roles": ["musician"],
            "category": "ability",
            "evidence": [
                {
                    "description": "Complex fingering patterns for guitar and bass performance",
                    "outcome": "Professional-level musical execution after 30+ years practice"
                }
            ],
            "outcomes": ["Quickly move hand or together with arm to grasp or manipulate objects"]
        },
        {
            "name": "Finger Dexterity",
            "proficiency": "Mastery",
            "roles": ["musician"],
            "category": "ability",
            "evidence": [
                {
                    "description": "Precise finger movements for musical performance at speed",
                    "outcome": "Clean articulation, accurate note execution in demanding passages"
                }
            ],
            "outcomes": ["Make precisely coordinated movements of fingers to grasp small objects"]
        },
        {
            "name": "Far Vision",
            "proficiency": "Advanced",
            "roles": ["pilot"],
            "category": "ability",
            "evidence": [
                {
                    "description": "Spotted traffic and terrain from distance during flight operations",
                    "outcome": "Early awareness enabled safe separation and navigation"
                }
            ],
            "outcomes": ["See details at a distance"]
        },
        {
            "name": "Night Vision",
            "proficiency": "Advanced",
            "roles": ["pilot"],
            "category": "ability",
            "evidence": [
                {
                    "description": "Night IFR operations require adaptation to low light conditions",
                    "outcome": "Safe night flying, runway and traffic identification in dark conditions"
                }
            ],
            "outcomes": ["See under low light conditions"]
        },
        {
            "name": "Depth Perception",
            "proficiency": "Mastery",
            "roles": ["pilot"],
            "category": "ability",
            "evidence": [
                {
                    "description": "Judged height above ground during landing flare with no altitude references",
                    "outcome": "Consistent smooth landings, perfect touchdown during emergency"
                }
            ],
            "outcomes": ["Judge distances between yourself and objects"]
        },
        {
            "name": "Hearing Sensitivity",
            "proficiency": "Mastery",
            "roles": ["musician"],
            "category": "ability",
            "evidence": [
                {
                    "description": "Detect pitch variations and tonal quality in musical performance",
                    "outcome": "Precise intonation, harmonic awareness in ensemble playing"
                }
            ],
            "outcomes": ["Detect or tell differences between sounds"]
        },
        {
            "name": "Auditory Attention",
            "proficiency": "Mastery",
            "roles": ["pilot", "musician"],
            "category": "ability",
            "evidence": [
                {
                    "description": "Focus on specific radio communications in busy airspace with multiple frequencies",
                    "outcome": "Never missed calls, maintained awareness in complex audio environment"
                }
            ],
            "outcomes": ["Focus on a single source of sound in the presence of other sounds"]
        },
        {
            "name": "Speech Clarity",
            "proficiency": "Mastery",
            "roles": ["strategy", "futurist"],
            "category": "ability",
            "evidence": [
                {
                    "description": "Clear radio communications in cockpit, presentations to large audiences",
                    "outcome": "ATC never requested repeats, audiences consistently rated delivery highly"
                }
            ],
            "outcomes": ["Speak clearly so others can understand you"]
        },
        {
            "name": "Attention to Detail",
            "proficiency": "Mastery",
            "roles": ["pilot", "strategy"],
            "category": "workstyle",
            "evidence": [
                {
                    "description": "Meticulous pre-flight inspections caught 3 maintenance issues before flight",
                    "outcome": "Prevented in-flight failures, maintained perfect safety record"
                }
            ],
            "outcomes": ["Careful about detail, thorough in completing tasks"]
        },
        {
            "name": "Dependability",
            "proficiency": "Mastery",
            "roles": ["pilot", "strategy"],
            "category": "workstyle",
            "evidence": [
                {
                    "description": "150+ weekly newsletter issues published on schedule over 3 years",
                    "outcome": "Built trust with subscribers through consistency"
                }
            ],
            "outcomes": ["Reliable, responsible, dependable in fulfilling obligations"]
        },
        {
            "name": "Achievement/Effort",
            "proficiency": "Mastery",
            "roles": ["strategy", "entrepreneur"],
            "category": "workstyle",
            "evidence": [
                {
                    "description": "Pursued instrument rating through self-study and practice beyond initial training",
                    "outcome": "Passed on first attempt, maintained proficiency through continuous learning"
                }
            ],
            "outcomes": ["Persistent in working toward goals despite obstacles"]
        },
        {
            "name": "Persistence",
            "proficiency": "Mastery",
            "roles": ["strategy", "entrepreneur", "advocate"],
            "category": "workstyle",
            "evidence": [
                {
                    "description": "Built Second Chance Foundation from concept to operational charity over 7 years",
                    "outcome": "Sustained impact: 200+ people transported, model adopted by 3 regional programs"
                }
            ],
            "outcomes": ["Continue despite challenges, don't give up easily"]
        },
        {
            "name": "Initiative",
            "proficiency": "Mastery",
            "roles": ["strategy", "entrepreneur"],
            "category": "workstyle",
            "evidence": [
                {
                    "description": "Proactively launched newsletter without executive approval or marketing budget",
                    "outcome": "Generated 300+ leads, became strategic asset, no permission needed"
                }
            ],
            "outcomes": ["Take on tasks without being told, identify opportunities independently"]
        },
        {
            "name": "Leadership",
            "proficiency": "Mastery",
            "roles": ["strategy", "advocate"],
            "category": "workstyle",
            "evidence": [
                {
                    "description": "Transformed underperforming team into strategic asset through vision and development",
                    "outcome": "Zero attrition, $20M in revenue impact, 2 promoted to director"
                }
            ],
            "outcomes": ["Willingness to lead and provide direction to others"]
        },
        {
            "name": "Self-Control",
            "proficiency": "Mastery",
            "roles": ["pilot", "advocate"],
            "category": "workstyle",
            "evidence": [
                {
                    "description": "Maintained composure during engine failure emergency despite life-threatening situation",
                    "outcome": "Calm execution of procedures, passengers felt reassured not panicked"
                }
            ],
            "outcomes": ["Maintain composure, control emotions in difficult situations"]
        },
        {
            "name": "Adaptability/Flexibility",
            "proficiency": "Mastery",
            "roles": ["strategy", "pilot"],
            "category": "workstyle",
            "evidence": [
                {
                    "description": "Led strategy team through 3 CEO transitions, adapting approach to each leader's style",
                    "outcome": "Maintained team performance and credibility despite organizational turbulence"
                }
            ],
            "outcomes": ["Open to change, flexible in approach"]
        },
        {
            "name": "Integrity",
            "proficiency": "Mastery",
            "roles": ["strategy", "advocate"],
            "category": "workstyle",
            "evidence": [
                {
                    "description": "Publicly shared recovery story despite professional risk, maintained authenticity",
                    "outcome": "Built deeper trust with stakeholders, 12 executives privately shared similar experiences"
                }
            ],
            "outcomes": ["Honest and ethical, adhere to values even when difficult"]
        },
        {
            "name": "Enterprise AI Strategy",
            "proficiency": "Mastery",
            "roles": ["strategy", "futurist", "tech"],
            "category": "unique",
            "evidence": [
                {
                    "description": "Led development of comprehensive AI strategy for TalentEdge—evaluation, roadmap, investment",
                    "outcome": "Board approved $15M investment, 3 features launched, 40% deal size increase"
                }
            ],
            "outcomes": ["Architect enterprise AI strategies that balance innovation with pragmatic implementation"]
        },
        {
            "name": "AI/ML Product Strategy",
            "proficiency": "Mastery",
            "roles": ["strategy", "tech", "futurist"],
            "category": "unique",
            "evidence": [
                {
                    "description": "Designed human-in-the-lead framework for AI product features, influenced product roadmap",
                    "outcome": "Framework became product design principle, 25% pricing premium vs competitors"
                }
            ],
            "outcomes": ["Translate AI capabilities into product strategy and market differentiation"]
        },
        {
            "name": "Strategic Foresight & Market Prediction",
            "proficiency": "Mastery",
            "roles": ["strategy", "futurist"],
            "category": "unique",
            "evidence": [
                {
                    "description": "85-95% prediction accuracy on 5-year HR tech trends including ATS obsolescence",
                    "outcome": "Positioned TalentEdge 18-24 months ahead of market, captured emerging opportunities"
                }
            ],
            "outcomes": ["Predict market evolution 2-3 years ahead through pattern recognition"]
        },
        {
            "name": "Predictive Framework Development",
            "proficiency": "Mastery",
            "roles": ["futurist", "strategy"],
            "category": "unique",
            "evidence": [
                {
                    "description": "Created reusable frameworks for evaluating technology adoption and market timing",
                    "outcome": "Frameworks adopted by team, improved decision quality across organization"
                }
            ],
            "outcomes": ["Build systematic approaches to forecasting that others can use"]
        },
        {
            "name": "Weak Signal Detection & Trend Recognition",
            "proficiency": "Mastery",
            "roles": ["futurist", "strategy"],
            "category": "unique",
            "evidence": [
                {
                    "description": "Identified early signals of conversational AI impact on recruiting in 2019",
                    "outcome": "Prediction validated 2022-2024, TalentEdge ready while competitors scrambled"
                }
            ],
            "outcomes": ["Spot emerging patterns before they're obvious to others"]
        },
        {
            "name": "Human-AI Collaboration Model Design",
            "proficiency": "Mastery",
            "roles": ["futurist", "strategy"],
            "category": "unique",
            "evidence": [
                {
                    "description": "Created human-in-the-lead framework as alternative to human-in-the-loop",
                    "outcome": "Framework adopted by industry, shifted discourse on AI collaboration"
                }
            ],
            "outcomes": ["Design frameworks for effective human-AI partnership"]
        },
        {
            "name": "Technical Concept Translation",
            "proficiency": "Mastery",
            "roles": ["futurist", "tech", "strategy"],
            "category": "unique",
            "evidence": [
                {
                    "description": "Translated complex AI/ML concepts for C-suite, sales team, and board",
                    "outcome": "Sales win rate improved 33%, board approved investment, no 'translation layer' needed"
                }
            ],
            "outcomes": ["Make technical concepts accessible without oversimplifying"]
        },
        {
            "name": "Research Synthesis & Pattern Recognition",
            "proficiency": "Mastery",
            "roles": ["futurist", "strategy"],
            "category": "unique",
            "evidence": [
                {
                    "description": "Synthesized 100+ research papers to identify market evolution patterns",
                    "outcome": "Frameworks validated by market, adopted by competitors and consultants"
                }
            ],
            "outcomes": ["Extract insights from disparate sources, identify non-obvious connections"]
        },
        {
            "name": "HR Technology Market Intelligence",
            "proficiency": "Mastery",
            "roles": ["strategy", "futurist"],
            "category": "unique",
            "evidence": [
                {
                    "description": "Deep knowledge of HR tech ecosystem—vendors, buyers, trends, competitive dynamics",
                    "outcome": "Informed M&A analysis, partnership decisions, product positioning"
                }
            ],
            "outcomes": ["Comprehensive understanding of talent technology landscape"]
        },
        {
            "name": "Candidate Experience Architecture",
            "proficiency": "Mastery",
            "roles": ["strategy"],
            "category": "unique",
            "evidence": [
                {
                    "description": "Developed candidate experience framework adopted by consulting firms",
                    "outcome": "Framework referenced in competitor materials and academic research"
                }
            ],
            "outcomes": ["Design end-to-end candidate experiences that drive outcomes"]
        },
        {
            "name": "C-Suite Advisory & Influence",
            "proficiency": "Advanced",
            "roles": ["strategy", "futurist"],
            "category": "unique",
            "evidence": [
                {
                    "description": "Advisory capacity with CEOs/CHROs of 40+ Fortune 500 companies through CAB",
                    "outcome": "Trusted advisor status, referenced in strategic planning discussions"
                }
            ],
            "outcomes": ["Influence executive decisions through credibility and insight"]
        },
        {
            "name": "Crisis Leadership & Decision Making",
            "proficiency": "Mastery",
            "roles": ["strategy", "advocate"],
            "category": "unique",
            "evidence": [
                {
                    "description": "Led organization through customer crises, team transitions, and aviation emergency",
                    "outcome": "Maintained performance under extreme pressure, deepened stakeholder relationships"
                }
            ],
            "outcomes": ["Lead effectively when stakes are highest and time is shortest"]
        },
        {
            "name": "FAA Certified IFR Pilot (Multi-Engine, 2000+ hrs)",
            "proficiency": "Mastery",
            "roles": ["pilot"],
            "category": "unique",
            "evidence": [
                {
                    "description": "20+ years as instrument-rated pilot, 2000+ hours including complex single-pilot IFR",
                    "outcome": "Perfect safety record, FAA commendation for emergency handling"
                }
            ],
            "outcomes": ["Operate aircraft safely in all conditions, make critical decisions under pressure"]
        },
        {
            "name": "Professional Musician (Guitar, Bass, Vocals - 30+ years)",
            "proficiency": "Mastery",
            "roles": ["musician"],
            "category": "unique",
            "evidence": [
                {
                    "description": "30+ years professional performance, recording, and instruction",
                    "outcome": "Performance-level skill, understanding of deliberate practice and mastery"
                }
            ],
            "outcomes": ["Professional musical performance, discipline of sustained practice"]
        },
        {
            "name": "Nonprofit Leadership & Advocacy (Second Chance Foundation)",
            "proficiency": "Mastery",
            "roles": ["advocate", "entrepreneur"],
            "category": "unique",
            "evidence": [
                {
                    "description": "Co-founded and lead Second Chance Foundation, aviation-focused mental health charity",
                    "outcome": "200+ people transported, 85% treatment completion, $500K+ raised, model adopted regionally"
                }
            ],
            "outcomes": ["Build and sustain mission-driven organization, channel grief into service"]
        }
    ],
    "values": [
        {
            "name": "Intellectual Integrity",
            "description": "Pursue truth over confirmation. Evidence-based decisions, always. Challenge assumptions before accepting conclusions.",
            "selected": true
        },
        {
            "name": "Strategic Foresight Over Reaction",
            "description": "Anticipate market shifts 18-24 months early. Lead change, don't follow it. 85-95% predictive accuracy through pattern recognition.",
            "selected": true
        },
        {
            "name": "Radical Transparency",
            "description": "Share hard truths directly and kindly. Reality-based planning wins. Confront problems early, not late.",
            "selected": true
        },
        {
            "name": "Outcome-Focused Excellence",
            "description": "Judge by impact delivered, not activity performed. Results drive everything. Measure outcomes, not effort.",
            "selected": true
        },
        {
            "name": "Elegant Simplicity",
            "description": "Distill complexity into clarity. Deep understanding enables simple solutions. Make sophisticated insights accessible.",
            "selected": true
        },
        {
            "name": "Authentic, Human Leadership",
            "description": "Lead with vulnerability and truth. Strength through self-awareness. Use personal experience to build trust and reduce stigma.",
            "selected": true
        }
    ],
    "purpose": "I help organizations navigate transformation through strategic foresight and evidence-based decision making. Using pattern recognition and predictive frameworks, I enable leaders to see market shifts 18-24 months early and make proactive choices. My diverse background—from single-pilot IFR operations to nonprofit founding to professional music—provides unique perspectives on high-stakes decision making, crisis leadership, and authentic human connection. I lead with transparency and use personal experience with recovery to build trust that enables honest discourse about complex challenges."
}
