{
  "profile": {
    "name": "Daenerys Targaryen",
    "currentTitle": "Queen of the Andals, the Rhoynar, and the First Men",
    "location": "Dragonstone, Westeros",
    "roleLevel": "C-Suite",
    "email": "",
    "summary": "From stateless refugee to sovereign of the largest military force in the known world. Built an empire from zero assets through liberation movements, strategic conquests, and an unshakable vision of a better world. Commanded three dragons, an army of formerly enslaved soldiers, and a Dothraki horde — scaling from nothing to continental power in under eight years. The ultimate founder story."
  },
  "roles": [
    {
      "id": "empire-building",
      "name": "Empire Building & Vision",
      "color": "#8B0000"
    },
    {
      "id": "military-command",
      "name": "Military Command",
      "color": "#2F4F4F"
    },
    {
      "id": "liberation",
      "name": "Liberation & Social Transformation",
      "color": "#B8860B"
    },
    {
      "id": "diplomacy",
      "name": "Diplomacy & Alliance Building",
      "color": "#4169E1"
    },
    {
      "id": "governance",
      "name": "Governance",
      "color": "#6A0DAD"
    }
  ],
  "skills": [
    {
      "name": "Visionary Leadership",
      "level": "Expert",
      "role": "Empire Building & Vision",
      "evidence": [
        "Articulated a compelling vision of liberation that recruited armies, advisors, and entire cities to her cause",
        "Maintained strategic direction across an 8-year campaign spanning two continents and dozens of military engagements",
        "Inspired loyalty from culturally diverse followers — Dothraki, Unsullied, Essosi freedmen, and Westerosi lords — through shared purpose"
      ]
    },
    {
      "name": "Scaling Operations",
      "level": "Expert",
      "role": "Empire Building & Vision",
      "evidence": [
        "Grew from a single khalasar to commanding the largest combined military force in known history",
        "Scaled governance from a single city (Meereen) to preparation for continental rule",
        "Built organizational infrastructure — advisors, commanders, supply chains — to support exponential growth"
      ]
    },
    {
      "name": "Military Strategy",
      "level": "Expert",
      "role": "Military Command",
      "evidence": [
        "Conquered three slave cities (Astapor, Yunkai, Meereen) through distinct tactical approaches — deception, siege, and infiltration",
        "Unified Dothraki khalasars under single command — the first leader to do so since Khal Menin",
        "Executed combined-arms warfare integrating dragon air power, cavalry, and infantry at the Battle of the Goldroad"
      ]
    },
    {
      "name": "Force Projection",
      "level": "Expert",
      "role": "Military Command",
      "evidence": [
        "Deployed three dragons as strategic weapons — fundamentally changing the military calculus of every engagement",
        "Used dragon demonstrations as diplomatic leverage — the threat of force as substitute for its use",
        "Projected military power across the Narrow Sea through naval logistics and alliance with Yara Greyjoy's Iron Fleet"
      ]
    },
    {
      "name": "Liberation Strategy",
      "level": "Expert",
      "role": "Liberation & Social Transformation",
      "evidence": [
        "Freed the Unsullied of Astapor through a tactical deception that simultaneously acquired an army and destroyed a slave market",
        "Liberated Meereen through alliance with enslaved populations who opened the city from within",
        "Built a political movement around abolition that attracted followers from across Essos"
      ]
    },
    {
      "name": "Social Transformation",
      "level": "Proficient",
      "role": "Liberation & Social Transformation",
      "evidence": [
        "Abolished slavery across Slaver's Bay — restructuring an entire regional economy",
        "Attempted to build new social institutions in Meereen including courts, labor systems, and civil governance",
        "Navigated the backlash of economic disruption from abolition including insurgency, economic collapse, and foreign intervention"
      ]
    },
    {
      "name": "Coalition Building",
      "level": "Expert",
      "role": "Diplomacy & Alliance Building",
      "evidence": [
        "United the Unsullied, Dothraki, Dornish, Greyjoy, and Tyrell forces under a single command structure",
        "Secured alliance with Jon Snow and the North through negotiation, mutual respect, and shared threat assessment",
        "Built advisor corps spanning multiple cultures — Tyrion (Westerosi), Missandei (Naathi), Grey Worm (Astapori), Jorah (Northern)"
      ]
    },
    {
      "name": "Diplomatic Communication",
      "level": "Proficient",
      "role": "Diplomacy & Alliance Building",
      "evidence": [
        "Negotiated with the Masters of Yunkai, the leaders of Qarth, and Westerosi lords across multiple diplomatic contexts",
        "Used titles and ceremony as diplomatic tools — projecting legitimate authority before it was fully established",
        "Communicated in Dothraki, High Valyrian, and Common Tongue — adapting language and register to audience"
      ]
    },
    {
      "name": "Crisis Leadership",
      "level": "Expert",
      "role": "Military Command",
      "evidence": [
        "Survived the destruction of her khalasar, assassination attempts, and military defeats without losing strategic coherence",
        "Led the defense of Winterfell against the Army of the Dead — committing her forces to an existential fight not her own",
        "Made real-time tactical decisions during the Battle of King's Landing including deployment of Drogon against fortified defenses"
      ]
    },
    {
      "name": "Talent Identification",
      "level": "Expert",
      "role": "Empire Building & Vision",
      "evidence": [
        "Recognized Jorah Mormont's value despite his betrayal — ultimately accepting him back after he proved his loyalty",
        "Appointed Tyrion Lannister as Hand despite his family being her sworn enemies — correctly assessing his strategic value",
        "Identified Missandei's diplomatic and linguistic capabilities and elevated her from translator to chief advisor"
      ]
    },
    {
      "name": "Brand Building",
      "level": "Expert",
      "role": "Empire Building & Vision",
      "evidence": [
        "Built 'Breaker of Chains' brand that preceded her — cities opened their gates based on reputation alone",
        "Used dragon imagery, ceremony, and spectacle to project power beyond her actual military reach",
        "Created a personal brand so compelling that people crossed continents to serve her cause"
      ]
    },
    {
      "name": "Insurgency Management",
      "level": "Proficient",
      "role": "Governance",
      "evidence": [
        "Fought the Sons of the Harpy insurgency in Meereen through combined military and political approaches",
        "Learned that military conquest without institutional governance creates power vacuums that breed resistance",
        "Adapted counterinsurgency strategy from pure force to political compromise — opening fighting pits as concession"
      ]
    },
    {
      "name": "Resource Acquisition",
      "level": "Expert",
      "role": "Empire Building & Vision",
      "evidence": [
        "Acquired the Unsullied army through tactical deception costing zero gold",
        "United all Dothraki khalasars by demonstrating power through fire — converting rivals into followers",
        "Secured ships, supplies, and allies through a combination of negotiation, demonstration, and strategic marriage"
      ]
    },
    {
      "name": "Public Speaking",
      "level": "Expert",
      "role": "Liberation & Social Transformation",
      "evidence": [
        "Delivered speeches in multiple languages that moved crowds of thousands to immediate action",
        "Used rhetoric of liberation and justice to build loyalty more durable than any political arrangement",
        "Spoke to the Dothraki in their language about their destiny — earning respect that previous leaders demanded through combat"
      ]
    },
    {
      "name": "Governance Design",
      "level": "Competent",
      "role": "Governance",
      "evidence": [
        "Attempted to design new economic and social systems for post-slavery Meereen",
        "Established courts, appointed administrators, and created civil infrastructure in conquered cities",
        "Struggled with the gap between revolutionary vision and institutional governance — a common founder challenge"
      ]
    },
    {
      "name": "Naval Strategy",
      "level": "Competent",
      "role": "Military Command",
      "evidence": [
        "Coordinated naval transport of 100,000+ troops across the Narrow Sea",
        "Secured Greyjoy fleet alliance providing naval superiority for the Westeros campaign",
        "Understood the strategic importance of Dragonstone as naval staging point for continental invasion"
      ]
    },
    {
      "name": "Cross-Cultural Leadership",
      "level": "Expert",
      "role": "Diplomacy & Alliance Building",
      "evidence": [
        "Led organizations spanning Dothraki, Unsullied, Westerosi, Naathi, and other cultures simultaneously",
        "Adapted leadership style from Dothraki warrior-queen to Meereenese ruler to Westerosi sovereign",
        "Built trust across cultural boundaries through shared mission rather than shared heritage"
      ]
    },
    {
      "name": "Supply Chain Management",
      "level": "Competent",
      "role": "Governance",
      "evidence": [
        "Managed logistics for continental-scale military campaigns including food, arms, and transport",
        "Organized the feeding and supply of a combined army of Dothraki and Unsullied during the march North",
        "Dealt with supply disruption when Euron Greyjoy destroyed her fleet — adapting logistics in real-time"
      ]
    },
    {
      "name": "Resilience",
      "level": "Expert",
      "role": "Empire Building & Vision",
      "evidence": [
        "Survived assassination by the warlocks of Qarth, the Sons of the Harpy, and multiple military defeats",
        "Rebuilt her power base from near-zero after being separated from her army and stranded in the Dothraki Sea",
        "Lost her husband, two of her dragons, her closest advisor, and her claim to the throne — continuing forward each time"
      ]
    },
    {
      "name": "Succession & Legacy Planning",
      "level": "Developing",
      "role": "Governance",
      "evidence": [
        "Struggled to define succession plan given her belief in her own inability to bear heirs",
        "Failed to build institutional structures that could outlast her personal rule",
        "Acknowledged the limitation — 'break the wheel' vision was about systems, not dynasties — but implementation lagged"
      ]
    }
  ],
  "values": [
    {
      "name": "Courage",
      "selected": true
    },
    {
      "name": "Purpose Over Profit",
      "selected": true
    },
    {
      "name": "Empowerment",
      "selected": true
    },
    {
      "name": "Resilience",
      "selected": true
    },
    {
      "name": "Bias Toward Action",
      "selected": true
    },
    {
      "name": "Liberation Through Domination",
      "selected": true,
      "custom": true
    }
  ],
  "purpose": "To break the wheel of power that crushes the people beneath it — building a world where no one is property and everyone has a voice.",
  "workHistory": [
    {
      "title": "Queen of the Seven Kingdoms",
      "company": "Targaryen Restoration — Dragonstone",
      "startDate": "2017-07",
      "endDate": "2019-05",
      "description": "Led invasion of Westeros. United forces against the Night King at the Battle of Winterfell. Conquered King's Landing."
    },
    {
      "title": "Queen of Meereen",
      "company": "Bay of Dragons — Meereen",
      "startDate": "2014-01",
      "endDate": "2017-07",
      "description": "Governed Meereen after liberation. Abolished slavery, fought Sons of the Harpy insurgency, established civil institutions. Built combined military force for Westeros campaign."
    },
    {
      "title": "Liberator & Conqueror",
      "company": "Slaver's Bay Campaign",
      "startDate": "2012-06",
      "endDate": "2014-01",
      "description": "Conquered Astapor, Yunkai, and Meereen. Freed hundreds of thousands of enslaved people. Acquired the Unsullied army and built a liberation movement that reshaped the region."
    },
    {
      "title": "Khaleesi",
      "company": "Dothraki — Khal Drogo's Khalasar",
      "startDate": "2011-01",
      "endDate": "2012-06",
      "description": "Rose from political marriage to leadership of a 40,000-strong Dothraki khalasar. Hatched three dragons — the first in over 150 years. Began building the coalition that would conquer a continent."
    },
    {
      "title": "Exile",
      "company": "House Targaryen — In Exile",
      "startDate": "1991-01",
      "endDate": "2011-01",
      "description": "Stateless refugee, sheltered by allies in the Free Cities. Survived assassination attempts, political manipulation, and the psychological abuse of her brother Viserys."
    }
  ],
  "education": [
    {
      "degree": "Self-Directed Education",
      "institution": "Free Cities & Campaign Experience",
      "year": "2011",
      "field": "Military Strategy, Governance, Languages, Dragon Husbandry"
    }
  ],
  "certifications": []
}