{
  "templateId": "roman-roy",
  "profile": {
    "name": "Roman Roy",
    "currentTitle": "COO, Waystar Royco",
    "location": "New York, NY",
    "roleLevel": "Executive",
    "headline": "Media executive with instinctive understanding of content, audience psychology, and digital consumer behavior. Known for unconventional strategic insights that more analytical leaders miss.",
    "executiveSummary": "Youngest Roy sibling who rose through Waystar Royco's entertainment and digital divisions, bringing an intuitive grasp of audience psychology and content strategy that contrasts with the company's traditional analytical approach. Successfully managed international partner relationships including the complex GoJo/Matsson negotiation. Known for irreverent communication style that masks sharp strategic instincts and surprising emotional intelligence in one-on-one settings."
  },
  "roles": [
    { "name": "Content & Entertainment", "id": "content" },
    { "name": "Digital Media", "id": "digital" },
    { "name": "Brand & Marketing", "id": "brand" },
    { "name": "Corporate Leadership", "id": "leadership" },
    { "name": "International Partnerships", "id": "international" }
  ],
  "skills": [
    {
      "name": "Content Strategy",
      "level": "Expert",
      "category": "skill",
      "key": true,
      "roles": ["content"],
      "evidence": [
        { "outcome": "Identified content gaps in Waystar entertainment portfolio before analytics confirmed them", "description": "Applied intuitive understanding of audience psychology to spot programming weaknesses others missed" },
        { "outcome": "Championed digital-first content initiative that drove 40% increase in younger demographic engagement", "description": "Advocated for content format and distribution changes targeting underserved audience segments" }
      ]
    },
    {
      "name": "Brand Development",
      "level": "Expert",
      "category": "skill",
      "key": true,
      "roles": ["brand"],
      "evidence": [
        { "outcome": "Repositioned Brightstar Parks brand driving 15% attendance increase in first year", "description": "Directed brand refresh including visual identity, messaging, and experiential design" },
        { "outcome": "Developed brand architecture strategy for Waystar's consumer-facing properties", "description": "Created framework defining brand relationships across ATN, Brightstar, and entertainment divisions" }
      ]
    },
    {
      "name": "International Business Development",
      "level": "Expert",
      "category": "skill",
      "key": true,
      "roles": ["international", "leadership"],
      "evidence": [
        { "outcome": "Managed relationship with Lukas Matsson during GoJo merger negotiations", "description": "Built personal rapport with GoJo CEO facilitating deal progression when formal negotiations stalled" },
        { "outcome": "Explored expansion opportunities across 5 Asian markets for Waystar entertainment properties", "description": "Evaluated market entry strategies including joint ventures, licensing, and direct investment" }
      ]
    },
    {
      "name": "Digital Media Strategy",
      "level": "Expert",
      "category": "skill",
      "key": true,
      "roles": ["digital"],
      "evidence": [
        { "outcome": "Developed digital engagement strategy achieving 25% year-over-year audience growth", "description": "Created multi-platform content distribution approach leveraging social media, streaming, and interactive formats" }
      ]
    },
    {
      "name": "Entertainment Operations",
      "level": "Advanced",
      "category": "skill",
      "roles": ["content"],
      "evidence": [
        { "outcome": "Managed Waystar's theme park and entertainment division operations", "description": "Oversaw Brightstar Parks operational improvements including guest experience enhancement and new attraction development" }
      ]
    },
    {
      "name": "Audience Analytics",
      "level": "Advanced",
      "category": "skill",
      "roles": ["digital", "content"],
      "evidence": [
        { "outcome": "Applied audience behavior insights to inform content commissioning decisions", "description": "Translated viewership patterns and engagement data into actionable content development recommendations" }
      ]
    },
    {
      "name": "Partner Relationship Management",
      "level": "Expert",
      "category": "skill",
      "roles": ["international"],
      "evidence": [
        { "outcome": "Maintained productive relationship with difficult international partner through personal diplomacy", "description": "Used humor, authenticity, and strategic patience to navigate cultural and personality differences with key partners" }
      ]
    },
    {
      "name": "Strategic Communications",
      "level": "Advanced",
      "category": "skill",
      "roles": ["leadership", "brand"],
      "evidence": [
        { "outcome": "Drafted investor messaging that resonated with younger institutional analysts", "description": "Brought contemporary communication style to traditionally conservative corporate communications" }
      ]
    },
    {
      "name": "Product Innovation",
      "level": "Advanced",
      "category": "skill",
      "roles": ["digital", "content"],
      "evidence": [
        { "outcome": "Proposed interactive content format that became Waystar's fastest-growing digital product", "description": "Identified consumer trend toward interactive and participatory media experiences" }
      ]
    },
    {
      "name": "Social Media Strategy",
      "level": "Advanced",
      "category": "skill",
      "roles": ["digital", "brand"],
      "evidence": [
        { "outcome": "Directed Waystar social media strategy across 5 platforms reaching 50M+ combined followers", "description": "Applied native understanding of social media culture to corporate brand management" }
      ]
    },
    {
      "name": "Competitive Intelligence",
      "level": "Advanced",
      "category": "skill",
      "roles": ["leadership"],
      "evidence": [
        { "outcome": "Tracked competitor content strategies across streaming, social, and broadcast platforms", "description": "Monitored Netflix, Disney+, and platform competitor moves to inform Waystar content strategy" }
      ]
    },
    {
      "name": "Negotiation",
      "level": "Advanced",
      "category": "skill",
      "roles": ["international", "leadership"],
      "evidence": [
        { "outcome": "Negotiated content licensing deals worth $200M+ across international markets", "description": "Structured licensing agreements balancing revenue optimization with market development goals" }
      ]
    },
    {
      "name": "Marketing Strategy",
      "level": "Advanced",
      "category": "skill",
      "roles": ["brand"],
      "evidence": [
        { "outcome": "Redesigned Brightstar Parks marketing approach increasing digital ticket sales 60%", "description": "Shifted marketing spend from traditional channels to social and influencer-driven campaigns" }
      ]
    },
    {
      "name": "Executive Presence",
      "level": "Advanced",
      "category": "skill",
      "roles": ["leadership"],
      "evidence": [
        { "outcome": "Represented Waystar at international media summits and partner negotiations", "description": "Despite unconventional style, demonstrated ability to command executive settings when required" }
      ]
    },
    {
      "name": "Talent Scouting",
      "level": "Advanced",
      "category": "skill",
      "roles": ["content"],
      "evidence": [
        { "outcome": "Identified emerging creative talent for Waystar entertainment properties", "description": "Leveraged cultural awareness and industry relationships to source content creators and performers" }
      ]
    },
    {
      "name": "Creative Intuition",
      "level": "Expert",
      "category": "work style",
      "key": true,
      "roles": ["content"],
      "evidence": [
        { "outcome": "Consistently predicted content performance with higher accuracy than data-driven models", "description": "Applied instinctive audience understanding to content evaluation, outperforming analytical approaches in hit prediction" }
      ]
    },
    {
      "name": "Emotional Intelligence",
      "level": "Advanced",
      "category": "work style",
      "roles": ["leadership", "international"],
      "evidence": [
        { "outcome": "Read interpersonal dynamics in Matsson relationship that other executives missed", "description": "Identified emotional subtext and personal motivations driving partner behavior, enabling more effective engagement" }
      ]
    },
    {
      "name": "Humor & Levity",
      "level": "Expert",
      "category": "work style",
      "key": true,
      "roles": ["leadership"],
      "evidence": [
        { "outcome": "Used humor to defuse tense boardroom situations and build rapport in negotiations", "description": "Applied irreverent communication style strategically to create openings in high-pressure corporate settings" }
      ]
    },
    {
      "name": "Adaptability",
      "level": "Advanced",
      "category": "work style",
      "roles": ["leadership"],
      "evidence": [
        { "outcome": "Transitioned from entertainment focus to COO responsibilities during succession period", "description": "Expanded operational scope rapidly when opportunity required broader leadership capability" }
      ]
    },
    {
      "name": "Risk Appetite",
      "level": "Advanced",
      "category": "work style",
      "roles": ["leadership", "content"],
      "evidence": [
        { "outcome": "Championed high-risk content investments that outperformed conservative alternatives", "description": "Advocated for unconventional content bets that more risk-averse executives would have rejected" }
      ]
    },
    {
      "name": "Trend Forecasting",
      "level": "Advanced",
      "category": "skill",
      "roles": ["digital", "content"],
      "evidence": [
        { "outcome": "Predicted shift to short-form content 2 years before TikTok dominated media landscape", "description": "Identified emerging consumer preference for bite-sized content formats based on cultural observation" }
      ]
    },
    {
      "name": "Financial Analysis",
      "level": "Proficient",
      "category": "skill",
      "roles": ["leadership"],
      "evidence": []
    },
    {
      "name": "Operations Management",
      "level": "Proficient",
      "category": "skill",
      "roles": ["leadership"],
      "evidence": []
    },
    {
      "name": "Influencer Marketing",
      "level": "Advanced",
      "category": "skill",
      "roles": ["brand", "digital"],
      "evidence": [
        { "outcome": "Pioneered influencer partnership program for Brightstar Parks generating earned media worth $5M+", "description": "Built influencer relationships and created experiential partnerships driving organic social reach" }
      ]
    }
  ],
  "values": [
    { "name": "Creativity", "level": "core" },
    { "name": "Independence", "level": "core" },
    { "name": "Recognition", "level": "important" },
    { "name": "Power", "level": "important" },
    { "name": "Fun", "level": "important" }
  ],
  "workHistory": [
    {
      "title": "COO",
      "company": "Waystar Royco",
      "startYear": 2020,
      "endYear": null,
      "current": true,
      "description": "Expanded from entertainment division leadership to full COO responsibilities. Managed GoJo merger relationship and represented Waystar in international partnerships."
    },
    {
      "title": "President, Entertainment Division",
      "company": "Waystar Royco",
      "startYear": 2016,
      "endYear": 2020,
      "description": "Led Brightstar Parks, entertainment content, and digital media operations. Drove brand repositioning and digital audience growth strategy."
    },
    {
      "title": "VP, Digital Content",
      "company": "Waystar Royco",
      "startYear": 2013,
      "endYear": 2016,
      "description": "Managed digital content strategy and social media operations. Built digital audience across platforms."
    }
  ],
  "education": [
    {
      "institution": "Brown University",
      "degree": "B.A. Modern Culture & Media",
      "year": 2012
    }
  ],
  "certifications": [],
  "purpose": "Everyone wants to be profound. I just want to be right — and have a good time getting there."
}
