{
  "profile": {
    "name": "Tywin Lannister",
    "currentTitle": "Hand of the King & Warden of the West",
    "location": "Casterly Rock, The Westerlands",
    "roleLevel": "C-Suite",
    "email": "",
    "summary": "The most powerful man in Westeros for four decades. Rebuilt House Lannister from near-ruin into the wealthiest and most feared dynasty on the continent. Served as Hand of the King for 20 years under Aerys Targaryen, making the realm function while the king descended into madness. Commanded the Lannister armies, managed the realm's finances, and installed his family on the Iron Throne. The gold standard — literally and figuratively — of executive leadership in Westeros."
  },
  "roles": [
    { "id": "executive-leadership", "name": "Executive Leadership", "color": "#B8860B" },
    { "id": "military-command", "name": "Military Command", "color": "#8B0000" },
    { "id": "financial-empire", "name": "Financial Empire", "color": "#228B22" },
    { "id": "dynasty-management", "name": "Dynasty & Succession", "color": "#6A0DAD" },
    { "id": "governance", "name": "Governance & Administration", "color": "#4169E1" }
  ],
  "skills": [
    { "name": "Executive Leadership", "level": "Expert", "role": "Executive Leadership", "evidence": ["Served as Hand of the King for 20 years under Aerys II — effectively governing the Seven Kingdoms while the monarch was incapacitated", "Rebuilt House Lannister from a position of weakness into the dominant political and economic force in Westeros", "Commanded respect from every lord, general, and monarch in the realm through demonstrated competence and ruthless consistency"] },
    { "name": "Strategic Planning", "level": "Expert", "role": "Executive Leadership", "evidence": ["Orchestrated the Red Wedding — a single event that ended the Northern rebellion, killed its leadership, and broke its military capacity", "Planned the Lannister succession strategy spanning decades — positioning children in marriages of maximum political value", "Designed the military campaign that defeated Stannis, contained Robb Stark, and secured the Iron Throne for House Lannister"] },
    { "name": "Military Command", "level": "Expert", "role": "Military Command", "evidence": ["Commanded Lannister forces during the War of the Five Kings — managing multiple fronts simultaneously", "Crushed the Reyne-Tarbeck rebellion as a young lord — eliminating two noble houses so completely the act became a warning song", "Executed decisive military action at the Battle of Blackwater — arriving with Tyrell forces to save King's Landing"] },
    { "name": "Army Logistics", "level": "Expert", "role": "Military Command", "evidence": ["Maintained supply lines for Lannister armies operating across the Riverlands, Crownlands, and Westerlands simultaneously", "Coordinated the movement and supply of 60,000 Lannister troops across the largest theater of war in a generation", "Managed the logistics of the combined Lannister-Tyrell relief force that marched to King's Landing for the Battle of Blackwater"] },
    { "name": "Financial Management", "level": "Expert", "role": "Financial Empire", "evidence": ["Controlled the gold mines of Casterly Rock — the primary source of wealth in the Seven Kingdoms", "Managed Lannister wealth across investments, lending, and strategic expenditure over four decades", "Used financial power as primary instrument of political control — 'a Lannister always pays his debts' became geopolitical doctrine"] },
    { "name": "Wealth Preservation", "level": "Expert", "role": "Financial Empire", "evidence": ["Maintained the Lannister fortune through multiple wars, political transitions, and economic disruptions", "Understood that the perception of wealth is as powerful as wealth itself — maintaining the illusion even as mines began to fail", "Diversified Lannister economic interests beyond gold mining into trade, lending, and political rents"] },
    { "name": "Alliance Architecture", "level": "Expert", "role": "Dynasty & Succession", "evidence": ["Engineered the Lannister-Tyrell alliance that provided the military and financial resources to win the War of the Five Kings", "Arranged strategic marriages for all three children to maximize political leverage — Cersei to Robert, attempted Tyrion to Sansa", "Built the Frey-Bolton alliance that executed the Red Wedding — reshaping the political map of Westeros in a single night"] },
    { "name": "Succession Planning", "level": "Expert", "role": "Dynasty & Succession", "evidence": ["Spent decades positioning House Lannister for multi-generational dominance of Westerosi politics", "Placed his daughter as Queen, his grandson on the throne, and himself as Hand — controlling all levers of power", "Understood that legacy is measured in generations, not years — every decision optimized for dynastic continuity"] },
    { "name": "Governance Administration", "level": "Expert", "role": "Governance", "evidence": ["Administered the Seven Kingdoms as Hand for two decades — the longest and most effective tenure in living memory", "Managed the Small Council, Crown finances, and military apparatus with systematic efficiency", "Governed the Westerlands as Warden of the West — maintaining order, collecting taxes, and resolving disputes across dozens of lordships"] },
    { "name": "Talent Management", "level": "Proficient", "role": "Executive Leadership", "evidence": ["Appointed effective administrators and military commanders based on competence — Kevan Lannister, Gregor Clegane, the Mountain's Men", "Identified Tyrion's administrative talent and assigned him appropriate roles despite personal animosity", "Maintained loyalty from bannermen through a combination of reward, obligation, and fear"] },
    { "name": "Intimidation & Deterrence", "level": "Expert", "role": "Executive Leadership", "evidence": ["The destruction of Houses Reyne and Tarbeck became the song 'The Rains of Castamere' — a deterrent so effective it prevented rebellion for 40 years", "Used reputation for ruthlessness as a strategic asset — reducing the need for actual military action", "The mere presence of Lannister forces was sufficient to secure compliance from most opponents"] },
    { "name": "Negotiation", "level": "Expert", "role": "Governance", "evidence": ["Negotiated the Lannister-Tyrell alliance under extreme time pressure during the Battle of Blackwater", "Structured the Red Wedding agreement with Walder Frey and Roose Bolton — balancing competing interests of treacherous allies", "Negotiated the terms of the Iron Throne's relationship with the Iron Bank of Braavos"] },
    { "name": "Crisis Management", "level": "Expert", "role": "Executive Leadership", "evidence": ["Rescued the Lannister position after Jaime's capture by Robb Stark's forces", "Managed the succession crisis after Joffrey's assassination — installing Tommen and maintaining governmental continuity", "Redirected the war effort after Robb Stark's initial military victories threatened Lannister control"] },
    { "name": "Organizational Restructuring", "level": "Expert", "role": "Governance", "evidence": ["Rebuilt House Lannister from a position where minor lords openly defied its authority to the dominant house in Westeros", "Restructured the Small Council after becoming Hand under Joffrey — removing incompetent appointees", "Reorganized Lannister military command structure to fight a multi-front war effectively"] },
    { "name": "Legacy Building", "level": "Expert", "role": "Dynasty & Succession", "evidence": ["Built a family legacy that dominated Westerosi politics for a generation — the Lannister name became synonymous with power", "Invested in infrastructure, alliances, and institutional positions to ensure Lannister influence outlasted any individual", "Understood that reputation is a compounding asset — every victory made the next one easier"] },
    { "name": "Delegation", "level": "Proficient", "role": "Executive Leadership", "evidence": ["Delegated military command effectively — trusting field commanders while maintaining strategic oversight", "Empowered Kevan Lannister as trusted second-in-command across multiple domains", "Assigned Tyrion to King's Landing as acting Hand — correctly assessing he would manage the crisis competently"] },
    { "name": "Political Judgment", "level": "Expert", "role": "Governance", "evidence": ["Correctly assessed that Robert's Rebellion would succeed and switched allegiance at the decisive moment", "Understood that Aerys's madness made continued service untenable — resigned as Hand before the dynasty fell", "Recognized the strategic value of the Red Wedding — ending a war that conventional military action could not resolve cleanly"] },
    { "name": "Supply Chain Management", "level": "Proficient", "role": "Military Command", "evidence": ["Managed gold mining, smelting, and distribution operations at Casterly Rock", "Organized food, arms, and material supply for extended military campaigns", "Understood the relationship between economic production and military capability at a strategic level"] },
    { "name": "Institutional Design", "level": "Proficient", "role": "Governance", "evidence": ["Built governance structures at Casterly Rock that functioned effectively in his absence", "Designed the administrative framework that allowed him to govern the Seven Kingdoms while simultaneously commanding armies in the field", "Created institutional incentives that aligned bannermen interests with Lannister objectives"] }
  ],
  "values": [
    { "name": "Excellence", "selected": true },
    { "name": "Accountability", "selected": true },
    { "name": "Strategic Thinking", "selected": true },
    { "name": "Resilience", "selected": true },
    { "name": "Bias Toward Action", "selected": true }
  ],
  "purpose": "A lion does not concern himself with the opinions of sheep. Legacy is the only currency that compounds after death — and a Lannister always pays his debts.",
  "workHistory": [
    { "title": "Hand of the King", "company": "The Crown — King Joffrey I / Tommen I", "startDate": "2012-06", "endDate": "2014-06", "description": "Returned as Hand to manage the War of the Five Kings. Orchestrated the Red Wedding, brokered the Tyrell alliance, and secured the Iron Throne for his grandson. Governed the realm while commanding military operations." },
    { "title": "Warden of the West", "company": "House Lannister — Casterly Rock", "startDate": "1966-01", "endDate": "2014-06", "description": "48 years as head of House Lannister. Rebuilt the house from weakness to dominance. Managed gold mining operations, bannerman relations, and military forces. The longest and most successful lordship in the Westerlands' history." },
    { "title": "Hand of the King", "company": "The Crown — King Aerys II Targaryen", "startDate": "1975-01", "endDate": "1994-01", "description": "Twenty years as Hand — the longest effective tenure in modern Westerosi history. Governed the Seven Kingdoms while Aerys descended into madness. Built the administrative infrastructure that kept the realm functioning. Resigned when the king's instability became unmanageable." },
    { "title": "Lord of Casterly Rock (Inherited)", "company": "House Lannister", "startDate": "1966-01", "endDate": "1975-01", "description": "Inherited lordship after father's ineffective rule nearly destroyed House Lannister's standing. Immediately crushed the Reyne-Tarbeck rebellion, re-established authority, and began rebuilding the family's political and financial power." }
  ],
  "education": [
    { "degree": "Noble Education & Court Service", "institution": "King's Landing — Court of Aerys II", "year": "1965", "field": "Governance, Military Strategy, Finance, Diplomacy" }
  ],
  "certifications": []
}
